In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("data_cleaning_sample.csv")

In [4]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [5]:
df.sort_values("Join Date")

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [6]:
df.sort_values("Join Date", ascending = False)

      Name   Age         City Gender              Email   Join Date
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [7]:
df.sort_values("Age")

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [9]:
df.sort_values(["Age" , "Join Date"])

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [10]:
df2 = df.sort_values(["Age", "Join Date"]).copy()

In [11]:
df2

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [12]:
df2.reset_index()

   index     Name   Age         City Gender              Email   Join Date
0      4    David  22.0       Mumbai      M  david@example.com  12-11-2019
1      0    Alice  25.0     New York      F  alice@example.com  01-05-2021
2      6    Alice  25.0     New York      F  alice@example.com  01-05-2021
3      7    Alice  25.0     New York      F  alice@example.com  01-05-2021
4      5      NaN  28.0        Delhi      F     eve@domain.com         NaN
5      2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
6      1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7      3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8      8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [13]:
df2

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [14]:
df2.reset_index(drop = True)

      Name   Age         City Gender              Email   Join Date
0    David  22.0       Mumbai      M  david@example.com  12-11-2019
1    Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3    Alice  25.0     New York      F  alice@example.com  01-05-2021
4      NaN  28.0        Delhi      F     eve@domain.com         NaN
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [15]:
df2

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [20]:
# df2.reset_index(drop=True, inplace=True)

In [21]:
df2

      Name   Age         City Gender              Email   Join Date
0    David  22.0       Mumbai      M  david@example.com  12-11-2019
1    Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3    Alice  25.0     New York      F  alice@example.com  01-05-2021
4      NaN  28.0        Delhi      F     eve@domain.com         NaN
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [22]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [19]:
df.sort_index()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [24]:
df2["Rank"] = df2["Join Date"].rank()

##

In [25]:
df2

      Name   Age         City Gender              Email   Join Date  Rank
0    David  22.0       Mumbai      M  david@example.com  12-11-2019   4.0
1    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
3    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
4      NaN  28.0        Delhi      F     eve@domain.com         NaN   NaN
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   5.0
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   7.0
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   7.0
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   7.0

In [28]:
df2["Rank"] = df2["Join Date"].rank(ascending = False, method ="dense")

In [29]:
df2

      Name   Age         City Gender              Email   Join Date  Rank
0    David  22.0       Mumbai      M  david@example.com  12-11-2019   3.0
1    Alice  25.0     New York      F  alice@example.com  01-05-2021   4.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   4.0
3    Alice  25.0     New York      F  alice@example.com  01-05-2021   4.0
4      NaN  28.0        Delhi      F     eve@domain.com         NaN   NaN
5      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   2.0
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   1.0
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   1.0
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   1.0